app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Product Management"], ["room_number", 234], ["created_at", "2020-12-13 21:26:23.706407"], ["updated_at", "2020-12-13 21:26:23.706407"]]
---
    def create
        @school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Data Science"], ["room_number", 129], ["updated_at", "2020-12-13 21:30:03.134690"], ["id", 1]]
---
    def update
        @school_class = SchoolClass.update(params.require(:school_class).permit(:title, :room_number))