app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Sarah"], ["last_name", "Kain2"], ["updated_at", "2020-12-13 21:00:11.466033"], ["id", 1]]
---
    def update
        @student = Student.update(params.require(:student).permit(:first_name, :last_name))